cases/ring_entry/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

libs            ("libsixDoFRigidBodyMotion.so");

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       0.0005;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");

        probeLocations
        (
            (0 0 0.05)   // Near bottom
            (0 0 0.10)
            (0 0 0.15)
            (0 0 0.20)
            (0 0 0.25)
            (0 0 0.30)   // Water surface
            (0 0 0.35)   // Ring initial position (5cm above surface)
            (0 0 0.40)   // Above water
            (0 0 0.45)
            (0 0 0.50)
        );

        fields         (alpha.water);
        writeControl   timeStep;
        writeInterval  10;
    }

    fountainSurface
    {
        type            surfaces;
        libs            ("libsampling.so");

        surfaceFormat   vtk;
        fields          (alpha.water p_rgh U);

        isoSurfaceField alpha.water;
        isoSurfaceValue 0.5;

        writeControl    timeStep;
        writeInterval   100;
    }

    forces
    {
        type            forces;
        libs            ("libforces.so");

        patches         (ringSurface);
        rho             rhoInf;
        rhoInf          1.2;
        CofR            (0 0 0);

        writeControl    timeStep;
        writeInterval   10;
    }

//    sixDoFRigidBodyState
//    {
//        type            sixDoFRigidBodyState;
//        libs            ("libsixDoFRigidBodyMotion.so");
//
//        writeControl    timeStep;
//        writeInterval   10;
//    }
}

// ************************************************************************* //