cases/ring_entry/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    (sixDoFRigidBodyMotion);

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolver    sixDoFRigidBodyMotion;

patches         (ringSurface);
innerDistance   0.05;
outerDistance   0.15;

centreOfMass    (0 0 0.35);  // Initial position: 5cm above water surface (z=0.3)
mass            0.117;        // TODO: Update based on new ring dimensions
momentOfInertia (2.64e-4 2.64e-4 2.64e-4);  // TODO: Update based on new ring dimensions
velocity        (0 0 0);      // Zero initial velocity (free fall under gravity)
omega           (0 0 0);
orientation     (1 0 0 0 1 0 0 0 1);

report                  on;
accelerationRelaxation  0.9;
accelerationDamping     0.95;

solver
{
    type Newmark;
}

restraints
{
    bottomWall
    {
        sixDoFRigidBodyMotionRestraint softWall;
        anchor          (0 0 0);
        refAttachmentPt (0 0 -0.0025);
        wallNormal      (0 0 1);
        psi             0.5;
        C               0.01;
    }
}

// ************************************************************************* //
