cases/ring_entry/constant/sixDoFRigidBodyMotion/restraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/sixDoFRigidBodyMotion";
    object      restraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// No gravity restraint needed - gravity is applied through constant/g field
// Gravity is automatically applied to sixDoFRigidBodyMotion via g field

// Optional: linear damper for stabilization
// linearDamper
// {
//     type            linearDamper;
//     coeff           0.1;
// }

// Optional: angular damper for stabilization
// angularDamper
// {
//     type            angularDamper;
//     coeff           0.1;
// }

// ************************************************************************* //