cases/ring_entry/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(p_rgh)     cellLimited Gauss linear 1;
}

divSchemes
{
    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)   Gauss linearUpwind grad(U);

    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega)  Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phirb,alpha)  Gauss interfaceCompression vanLeer 1;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

fluxRequired
{
    default         no;
    p_rgh           yes;
}

wallDist
{
    method meshWave;
}

// oversetInterpolation
// {
//     method              inverseDistance;
//     holeLayers          6;
//     useLayer            3;
// }
//
// oversetInterpolationSuppressed
// {
//     grad(p_rgh);
//     surfaceIntegrate(phiHbyA);
// }

// ************************************************************************* //