cases/ring_entry/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create cell set from the snappyHexMesh cellZone
    {
        name    ringCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            zone ringZone;
        }
    }

    // Create cell zone from cell set
    {
        name    ringZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set ringCells;
        }
    }
);

// ************************************************************************* //
